{
    "bienvenida": ["Hola. Soy tu Asistente Virtual. Fui creada para instruirte todo respecto a la Estructura de un computador. Antes de empezar ¿Podrias decirme tu nombre?"],
    "aprendizaje": {
        "seccion1":[
        "El objetivo principal del pensamiento computacional es resolver problemas utilizando algoritmos y abstracción.",
        "El primer paso del pensamiento computacional es identificar el problema, ¿verdadero?",
        "Un algoritmo, en términos de pensamiento computacional, es una secuencia de pasos para resolver un problema.",
        "El concepto introducido al inicio de este estudio es el de instrucción máquina en el contexto del pensamiento computacional."
        ],
        "seccion2":[
            ["Las instrucciones de máquina en un computador se definen como comandos en lenguaje binario que el procesador puede entender y ejecutar.",
            "El término 'repertorio de instrucciones' en relación con un computador se refiere al conjunto completo de todas las instrucciones de máquina que una CPU puede ejecutar.",
            "Los dos requisitos clave que debe cumplir el conjunto de instrucciones de un computador son completitud y eficacia.",
            "Las características generales que deben cumplir las instrucciones de máquina en un repertorio de instrucciones incluyen realizar una función única y sencilla, emplear un número fijo de operandos y tener una codificación sistemática.",
            "La identificación de las instrucciones de máquina en un lenguaje de programación se simplifica a través del uso de códigos mnemónicos, que son nombres en lenguaje humano para las instrucciones."],
            ["El direccionamiento mediante registro es un modo de direccionamiento en el que los operandos se almacenan en registros internos de la CPU.",
            "Una ventaja del direccionamiento mediante registro es que elimina la necesidad de acceder a la memoria principal.",
            "El direccionamiento relativo a registro puede introducir un pequeño retraso en la ejecución de una instrucción debido a que el desplazamiento debe calcularse antes de obtener la dirección del operando.",
            "Una característica del direccionamiento relativo a registro es que permite acceder a un conjunto de posiciones de memoria a partir de una dirección de referencia."]
        ],
        "seccion3":[
            [
                "Un modo de direccionamiento incluye Registro, Inmediato, Directo e Indirecto, lo que significa que la respuesta correcta es 'Todos los anteriores'.",
                "Una ventaja del direccionamiento inmediato es que no se requiere una referencia a memoria para obtener el operando.",
                "Una desventaja del direccionamiento inmediato es que requiere una referencia a memoria para obtener el operando.",
                "En el direccionamiento directo, la dirección del operando se encuentra en la instrucción.",
                "El direccionamiento inmediato es el modo de direccionamiento más rápido, lo cual es verdadero.",
                "El direccionamiento inmediato no requiere una referencia a memoria para obtener el operando, lo cual es falso, ya que se refiere al direccionamiento directo."
            ],
            [
                "En las instrucciones de transferencia de datos, los dos tipos de operandos son 'Origen y destino'.",
                "La longitud del dato a transferir se refiere a la cantidad de bits que ocupa el dato.",
                "La instrucción utilizada para copiar un dato de una posición de memoria a un registro es 'MOVE'.",
                "Las cuatro operaciones aritméticas básicas son suma, resta, multiplicación y división.",
                "Las operaciones lógicas bit a bit más comunes incluyen 'AND, OR, XOR y NOT'.",
                "La instrucción utilizada para sumar dos números enteros es 'ADD'.",
                "Las instrucciones que modifican la secuencia normal de ejecución de un programa son 'Instrucciones de salto'.",
                "Una bifurcación incondicional es un salto a una dirección específica en el programa.",
                "Una bifurcación condicional es un salto que se produce si se cumple una condición.",
                "La instrucción utilizada para saltar a una subrutina es 'CALL'.",
                "La instrucción que no hace nada se llama 'NOP'.",
                "La instrucción que detiene la ejecución de instrucciones se llama 'HALT'.",
                "La instrucción que activa una interrupción software es 'INT'."
            ],
            [
                "En las instrucciones de transferencia de datos, los dos tipos de operandos son 'Origen y destino'.",
                "La longitud del dato a transferir se refiere a la cantidad de bits que ocupa el dato.",
                "La instrucción utilizada para copiar un dato de una posición de memoria a un registro es 'MOVE'.",
                "Las cuatro operaciones aritméticas básicas son suma, resta, multiplicación y división.",
                "Las operaciones lógicas bit a bit más comunes incluyen 'AND, OR, XOR y NOT'.",
                "La instrucción utilizada para sumar dos números enteros es 'ADD'.",
                "Las instrucciones que modifican la secuencia normal de ejecución de un programa son 'Instrucciones de salto'.",
                "Una bifurcación incondicional es un salto a una dirección específica en el programa.",
                "Una bifurcación condicional es un salto que se produce si se cumple una condición.",
                "La instrucción utilizada para saltar a una subrutina es 'CALL'.",
                "La instrucción que no hace nada se llama 'NOP'.",
                "La instrucción que detiene la ejecución de instrucciones se llama 'HALT'.",
                "La instrucción que activa una interrupción software es 'INT'.",
                "El tipo de direccionamiento utilizado para acceder a un dato que se encuentra en una posición relativa a la instrucción actual es 'Direccionamiento relativo a registro'.",
                "El tipo de direccionamiento utilizado para acceder a un dato que se encuentra en una posición relativa al registro base es 'Direccionamiento relativo a registro base'.",
                "El tipo de direccionamiento utilizado para acceder a un dato que se encuentra en la pila es 'Direccionamiento relativo a pila'.",
                "El tipo de direccionamiento utilizado para acceder a un dato que se encuentra en una posición relativa a un registro índice es 'Direccionamiento indexado'.",
                "El tipo de direccionamiento utilizado para acceder a un dato que se encuentra en una posición especificada por un valor almacenado en memoria es 'Direccionamiento indirecto'."
            ],
            [
                "Al determinar el tamaño de las instrucciones en el diseño de un formato de instrucciones, es importante considerar 'El tamaño de la memoria disponible'.",
                "El compromiso fundamental al diseñar el formato de las instrucciones de una CPU es 'Encontrar un equilibrio entre instrucciones poderosas y simplificación de decodificación'.",
                "Los dos campos básicos presentes en un formato de instrucciones son 'Campo de operación y campo de dirección'.",
                "Las instrucciones se dividen en una serie de campos en el diseño del formato de instrucciones 'Para simplificar la decodificación y ejecución'."
            ]
        ]
    },
    "unidad central de proceso": ["La unidad central de proceso controla el funcionamiento de todos los elementos del computador. Controla el flujo de datos, los procesa, y gobierna el secuenciamiento y las acciones en todo el sistema.",
                                  "Una CPU básica consta principalmente de las siguientes unidades","Unidad de Control UC. Unidad Aritmetico Logica ALU. Registros internos",
                                  "La UNIDAD DE CONTROL UC, se encarga de leer de la memoria las instrucciones que se debe ejecutar y de secuenciar el acceso a los datos y las operaciones a realizar por la unidad de proceso. Se encarga de acceder a memoria habilitando un camino de datos para que las instrucciones y los datos lleguen a la CPU.",
                                  "La Unidad Aritmetico Logica ALU, es la parte de la CPU encargada de realizar las transformaciones de los datos. La ALU consta de una serie de modulos que permiten realizar operaciones aritmeticas y logicas.",
                                  "Los registros internos son pequeñas memorias de alta velocidad dentro de un computador que se utilizan para almacenar datos temporales y realizar operaciones rapidas."],
    "memoria": ["En la memoria se almacenaran el programa y los datos que, provenientes de un dispositivo de Entrada Salida o dispositivos de almacenamiento secundario, va a ejecutar la CPU. La matriz de memoria está organizada en palabras, cada una de las cuales tiene asignada una direccion que indica su posicion en la matriz.",
                "La memoria en un computador es un dispositivo electrónico que almacena temporalmente programas y datos que están siendo utilizados por el procesador, para acceder a ellos más rapidamente."],
    "entrada salida": ["Un computador tiene una gran cantidad de dispositivos de entrada y salida. Desde un teclado hasta un monitor de video, pasando por un disco duro, todos son dispositivos que la CPU necesita para obtener datos o para almacenar o mostrar resultados.",
                       "El principal problema de estos dispositivos perifericos es su gran variedad. Muchos de ellos comunican a un operador humano con el computador y otros sirven de conexion con otros computadores.",
                       "El objetivo de cada transferencia es llevar los datos desde el periferico a una zona concreta de la memoria y viceversa."],  
    "sistemas de interconexión buses": ["La conexion entre los diversos componentes de un computador se efectua fisicamente a traves de los buses. Un bus se define como un enlace de comunicacion compartido que usa multiples cables para conectar subsistemas.",
                                        "Cada linea es capaz de transmitir una tensión electrica que representa un uno o un cero binario.",
                                        "Las señales de los buses estan agrupadas siguiendo un criterio de funcionalidad:",
                                        "Bus de datos. Bus de direcciones. Bus de control. Bus de alimentacion",
                                        "Los buses de datos son las iineas por las que se transmiten los datos entre los diversos dispositivos que forman el computador.",
                                        "Los buses de direcciones sirven para indicar a la memoria o al resto de dispositivos la posicion del dato que se quiere acceder.",
                                        "Los buses de control agrupan todas las señales de control que gobiernan el acceso al bus de datos y direcciones. Agrupa señales de lectura, escritura, arbitraje, entre otros.",
                                        "Los buses de alimentacion son los cables o conexiones que suministran energia electrica a los componentes internos del equipo, como la placa madre, la CPU, las tarjetas de expansion y los dispositivos de almacenamiento."],
    "perifericos": ["Los perifericos son todos aquellos dispositivos que sin ser imprescindibles en la estructura de un computador, son necesarios para suministrar datos a la maquina o visualizar los resultados.",
                    "Los periféricos de entrada de datos son interruptores, teclados, ratones, pantallas graficas interactivas y digitalizadores de imagenes (escaners)."]
    
}